tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

brew "mas"
brew "yt-dlp"

cask "alfred"
cask "amethyst"
cask "arc"
cask "arq"
cask "bartender"
cask "cleanshot"
cask "devonthink"
cask "figma"
cask "firefox"

cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "font-monaspace"

cask "hammerspoon"
cask "hazel"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "logi-options-plus"
cask "marked"
cask "obsidian"
cask "orbstack"
cask "remarkable"
cask "soulver"
cask "transmit"
cask "visual-studio-code"
cask "xscope"

mas "BBEdit", id: 404009241
mas "Brother P-touch Editor", id: 1453365242
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Gestimer", id: 6447125648
mas "GoodLinks", id: 1474335294
mas "Goodnotes", id: 1444383602
mas "Mela", id: 1568924476
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Screens 5", id: 1663047912
mas "Slack", id: 803453959
mas "Tailscale", id: 1475387142
mas "Text Workflow", id: 1600520682
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693

vscode "bradlc.vscode-tailwindcss"
vscode "Compulim.compulim-vscode-closetag"
vscode "csstools.postcss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ronnidc.nunjucks"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-icons-mac"