tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/services"

brew "yt-dlp"
brew "mas"

cask "alfred"
cask "arc"
cask "amethyst"
cask "bartender"
cask "cleanshot"
cask "discord"
cask "figma"
cask "logi-options-plus"
cask "remarkable"
cask "devonthink"
cask "marked"
cask "hazel"
cask "karabiner-elements"
cask "hammerspoon"
cask "keyboard-maestro"
cask "qmk-toolbox"
cask "soulver"
cask "transmit"

cask "visual-studio-code"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-icons-mac"

# Font casks
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-inconsolata"

# Mac App Store
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Mela", id: 1568924476
mas "Screens 4", id: 1224268771
mas "Slack", id: 803453959
mas "Ivory", id: 6444602274
mas "GoodLinks", id: 1474335294
mas "Pixelmator Pro", id: 1289583905
mas "iA Writer", id: 775737590
mas "Reeder", id: 1529448980
mas "GoodNotes 6", id: 1444383602
mas "Text Workflow", id: 1600520682
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825