tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# GitHub command-line tool
brew "gh"

# Mac App Store command-line interface
brew "mas"

# Platform built on V8 to build network applications
brew "node"

# Manage multiple Node.js versions
brew "nvm"

# Interpreted, interactive, object-oriented programming language
brew "python@3.13"

# Feature-rich command-line audio/video downloader
brew "yt-dlp"

# Application launcher and productivity software
cask "alfred"

# Chromium based browser
cask "arc"

# Multi-cloud backup application
cask "arq"

# App to create, design, edit and browse SQLite 3 database files
cask "base"

# E-books management software
cask "calibre"

# Screen capturing tool
cask "cleanshot"

# Collect, organise, edit and annotate documents
cask "devonthink"

# Collaborative team software
cask "figma"

cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"
cask "font-monaspace"
cask "font-noto-sans-display"

# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"

# Tool to create text-based art
cask "monodraw"

# App to write, plan, collaborate, and get organised
cask "notion"

# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"

# Replacement for Docker Desktop
cask "orbstack"

# Notepad with a built-in calculator
cask "soulver"

# File transfer application
cask "transmit"

# Configurator of compatible keyboards in real time
cask "vial"

# Open-source code editor
cask "visual-studio-code"

# Gecko based web browser
cask "zen"

# Microsoft Teams (not available in MAS)
cask "microsoft-teams"

mas "Acorn", id: 6737921844
mas "BBEdit", id: 404009241
mas "Brother P-touch Editor", id: 1453365242
mas "Drafts", id: 1435957248
mas "Draw Things", id: 6444050820
mas "Fantastical", id: 975937182
mas "Gestimer", id: 6447125648
mas "Keynote", id: 409183694
mas "Mela", id: 1568924476
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "reMarkable", id: 1276493162
mas "Screens 5", id: 1663047912
mas "Slack", id: 803453959
mas "Text Workflow", id: 1600520682
mas "Things", id: 904280696
mas "Ulysses", id: 1225570693

vscode "anthropic.claude-code"